snlkuharlocal/src/DataProcessors/ОтбивкаПоПустымОбъёмамНакладных/ОтбивкаПоПустымОбъёмамНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтбивкаПоПустымОбъёмамНакладных</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ОтбивкаПоПустымОбъёмамНакладных/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СписокПолучателей=новый СписокЗначений;
	ТемаПисьма="Номенклатура с незаполненным объёмом";
	
	
	СписокПолучателей.Добавить("ovlto@collant.ru");
	СписокПолучателей.Добавить("adminschastsy@collant.ru");
	СписокПолучателей.Добавить("operatorschastsy@collant.ru");
	
	ПереносСтроки="<br>";
	ТекстПисьма="Просьба заполнить объём коробки по следующему списку позиций: " +ПереносСтроки;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	т1.Номенклатура.Родитель КАК Номенклатура
	             |ИЗ
	             |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |		Док.Номенклатура КАК Номенклатура
	             |	ИЗ
	             |		Документ.РасходнаяНакладная.Товары КАК Док
	             |	ГДЕ
	             |		Док.Ссылка.Проведен
	             |		И Док.Ссылка.Дата > &Дата
	             |		И Док.Ссылка.СостояниеНакладной <> &ВРаботе
	             |		И Док.Ссылка.Склад.Подразделение = &Подразделение
	             |		И Док.Номенклатура.Родитель.ОбъемКоробки = 0
	             |		И Док.Номенклатура.ОбъемКоробки = 0
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |		Док.Номенклатура
	             |	ИЗ
	             |		Документ.Перемещение.Товары КАК Док
	             |	ГДЕ
	             |		Док.Ссылка.Проведен
	             |		И Док.Ссылка.Дата > &Дата
	             |		И Док.Ссылка.СостояниеНакладной <> &ВРаботе
	             |		И Док.Ссылка.Склад.Подразделение = &Подразделение
	             |		И Док.Ссылка.СкладПолучатель.Подразделение <> &Подразделение				 
	             |		И Док.Номенклатура.Родитель.ОбъемКоробки = 0
	             |		И Док.Номенклатура.ОбъемКоробки = 0) КАК т1";
	запрос.УстановитьПараметр("ВРаботе",Перечисления.СостоянияНакладной.ВРаботе);
	запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()));
	запрос.УстановитьПараметр("Подразделение",Константы.УзелТранспортногоОтдела.Получить().Подразделение);	
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		для каждого СтрТЗ из результат цикл
			ТекстПисьма=ТекстПисьма+СтрТЗ.Номенклатура.Наименование+" (код - "+СтрТЗ.Номенклатура.код+")"+ПереносСтроки;
		КонецЦикла;		
		ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма);
	КонецЕсли;
	

	
КонецПроцедуры


Процедура ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма)
	СписокАдресов="";
	для каждого Стр из СписокПолучателей цикл
		если Найти(СписокАдресов,Стр.Значение)=0 тогда
			СписокАдресов=СписокАдресов+Стр.Значение+"##";
		КонецЕсли;
	КонецЦикла;
	СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	
	
	ЗаписьВРег=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	ЗаписьВРег.ДатаСозданияПисьма=ТекущаяДата();
	ЗаписьВРег.период=ЗаписьВРег.ДатаСозданияПисьма;
	
	ЗаписьВРег.ТекстПисьма=ТекстПисьма;
	ЗаписьВРег.ТемаПисьма=ТемаПисьма;
	ЗаписьВРег.СписокПолучателей=СписокАдресов;
	ЗаписьВРег.Записать();		
КонецПроцедуры
